In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib
import numpy as np
import seaborn as sns

In [4]:
df=pd.read_csv("StudentsPerformance.csv")

In [5]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

# 학생성적 불러오기
## p(수학 점수 =72)

In [6]:
x72=df[df['math score']==72]
x72

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
83,male,group E,associate's degree,standard,none,72,64,63
126,male,group B,some high school,standard,none,72,68,67
170,male,group A,high school,standard,completed,72,73,74
226,female,group C,some college,standard,none,72,72,71
345,female,group C,high school,standard,none,72,80,75
459,male,group B,high school,standard,completed,72,65,68
467,male,group A,high school,free/reduced,completed,72,67,65
547,male,group C,high school,standard,completed,72,67,64
642,female,group B,some high school,free/reduced,none,72,81,79
745,male,group D,associate's degree,standard,none,72,79,74
778,female,group A,some college,standard,completed,72,79,82
786,female,group E,some high school,free/reduced,none,72,79,77
814,female,group C,high school,standard,none,72,80,83
922,male,group D,high school,standard,none,72,66,66
940,male,group C,master's degree,free/reduced,completed,72,66,72
955,male,group E,associate's degree,standard,none,72,57,62
964,male,group D,some college,standard,none,72,57,58

In [7]:
n72=len(x72)
print(n72)

18

In [9]:
n= len(df)
n

1000

In [11]:
p=n72/n  #18/1000이다
print(p)

0.018

### p(수학 점수 >72)

In [12]:
a72=df[df['math score']>72] #수학점수가 72점 초과
a72

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
2,female,group B,master's degree,standard,none,90,95,93
4,male,group C,some college,standard,none,76,78,75
6,female,group B,some college,standard,completed,88,95,92
13,male,group A,some college,standard,completed,78,72,70
16,male,group C,high school,standard,none,88,89,86
...,...,...,...,...,...,...,...,...
984,female,group C,some high school,standard,none,74,75,82
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75
995,female,group E,master's degree,standard,completed,88,99,95
999,female,group D,some college,free/reduced,none,77,86,86

## 조건부 확률

## P(X=남자)

In [33]:
man= df[df['gender']=="male"]
man

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67
10,male,group C,associate's degree,standard,none,58,54,52
...,...,...,...,...,...,...,...,...
985,male,group A,high school,standard,none,57,51,54
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75
994,male,group A,high school,standard,none,63,63,62
996,male,group C,high school,free/reduced,none,62,55,55

In [34]:
p_man = len(man)/len(df)
p_man

0.482

## P 수학점수 72점 이상인 남자

In [35]:
man72=man[man['math score']>72] #수학점수가 72점 초과
man72

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
4,male,group C,some college,standard,none,76,78,75
13,male,group A,some college,standard,completed,78,72,70
16,male,group C,high school,standard,none,88,89,86
24,male,group D,bachelor's degree,free/reduced,completed,74,71,80
25,male,group A,master's degree,free/reduced,none,73,74,72
...,...,...,...,...,...,...,...,...
971,male,group C,some high school,standard,completed,78,72,69
981,male,group D,some high school,standard,none,81,78,78
982,male,group B,some high school,standard,completed,79,85,86
987,male,group E,some high school,standard,completed,81,75,76
990,male,group E,high school,free/reduced,completed,86,81,75

In [36]:
p_man72=len(man72)/len(df)
p_man72

0.197

## (P 수학점수 > 72 | X = 남자 )

In [37]:
p_man72/p_man

0.40871369294605814